public class Lab3Main {

    // Напишите алгоритм поиска «следующего» узла для заданного узла в бинарном дереве поиска.
    // Считайте, что у каждого узла есть ссылка на его родителя.
    public static void main(String[] args) {
        // 6
        System.out.println("Hello world!");


    }
}